In [2]:
# 파일에서 데이터 불러오기
!conda list | grep pandas

'conda'��(��) ���� �Ǵ� �ܺ� ����, ������ �� �ִ� ���α׷�, �Ǵ�
��ġ ������ �ƴմϴ�.

In [5]:
import pandas as pd

In [8]:
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list.csv')

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [12]:
df.head()   #처음부터 5개만 보여줌

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [13]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [14]:
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [16]:
#csv파일 뿐만 아니라 txt파일도 불러올 수 있다.
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list.txt')

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [18]:
#만약 쉼표가 아니라 tab으로 데이터가 구분되어 있으면 어떻게 될까
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list_tab.txt')

In [19]:
df  #데이터가 하나의 컬럼만 생성되고, tab이 데이터에 들어가 버렸다.

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [25]:
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list_tab.txt',delimiter='\t')
#데이터의 딜리미터가 탭임을 알려주어야 한다.

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [27]:
#위의 파일에는 항상 헤더정보가 있었다. 항상 첫번째 행은 컬럼의 이름이 있다. 그런데 데이터들만 있는 경우에는 어떻게 하나?
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list_no_head.csv')

In [28]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [29]:
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list_no_head.csv',header=None)

In [30]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [33]:
df.columns=['name','age','job']

In [34]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [36]:
#한번에 할 수는 없나?
df=pd.read_csv('C:\\Users\\cpis7\\Downloads\\pandas-master\\pandas-master\\data\\friend_list_no_head.csv',header=None,names=['name','age','job'])

In [37]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern